<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<html>
<head>
    <title>Java Technologies</title>
</head>
<body>
  <h1>Java Technologies</h1>
  <h2>Java EE (Java Platform, Enterprise Edition):</h2>
  <h3>Java EE была ранее известна как J2EE и представляет собой
    стандартную платформу для разработки корпоративных приложений.
    Она включает в себя множество спецификаций, таких как Servlets,
    JSP, EJB (Enterprise JavaBeans), JMS (Java Messaging Service), и многое другое.</h3>
  <h2>Spring Framework:</h2>
  <h3>Spring - это популярный фреймворк, предназначенный для создания Java-приложений.
    Он обеспечивает управление зависимостями, инверсию управления (IoC), а также модули
    для веб-приложений, безопасности, обработки данных и другие.</h3>
  <h2>Hibernate:</h2>
  <h3>Hibernate - это фреймворк для объектно-реляционного отображения (ORM),
    который упрощает взаимодействие с базами данных, представляя их в виде объектов.
    Он широко используется для работы с базами данных в Java Enterprise приложениях.</h3>
  <h2>JavaServer Faces (JSF): </h2>
  <h3>JSF - это стандартный фреймворк для создания веб-интерфейсов на основе компонентов.
    Он предоставляет богатый набор компонентов для создания интерактивных веб-приложений.</h3>
  <h2>Microservices: </h2>
  <h3>Microservices архитектура - это подход к разработке, при котором большие приложения
    разбиваются на мелкие, независимые сервисы, каждый из которых выполняет конкретную функцию.
    Этот подход позволяет улучшить масштабируемость и обеспечить более гибкое развертывание.</h3>
  <h2>Spring Boot: </h2>
  <h3>Spring Boot - это инструмент, который упрощает создание и развертывание приложений
    на основе Spring. Он предоставляет множество стандартных настроек и автоматизации для
    разработки веб-приложений, RESTful служб и микросервисов.</h3>
  <h2>Apache Maven и Gradle:</h2>
  <h3>Эти инструменты для управления зависимостями и сборки позволяют легко управлять
    зависимостями и собирать проекты в Java Enterprise разработке.</h3>
  <h2>JPA (Java Persistence API): </h2>
  <h3>JPA - это стандартный интерфейс для работы с базами данных в Java-приложениях. Он
    предоставляет абстракцию над ORM и позволяет взаимодействовать с базами данных, используя
    Java объекты.</h3>
  <h2>WebSocket:</h2>
  <h3>WebSocket - это протокол для обеспечения двусторонней связи между клиентом и сервером
    через одно соединение TCP. Он используется для создания интерактивных веб-приложений.</h3>
</body>
</html>
